#include<stdio.h>
/*
	或运算:
		10->1 01->1 00->0 11->1
	规律:
		遇到1该数变成1,遇到0该数不变
	用途:
		将某一个或者几个数变成1就可以或运算
*/
void test1(){
	//0011 1000 如果要把前面4个灯不变,后面4个灯全亮,就可以使用或运算
	int number1 = 56;				//0011 1000
	int number2 = 15;				//0000 1111
	int result = number1 | number2; //0011 1111
}
/*
	与运算:
		10->0 01->0 11->1 00->0
	规律:
		遇到0该数变成0,遇到1该数不变
	用途:
		将某一个或者几个数变成0就可以与运算	
*/
void test2(){
	//0011 1000 如果要把前面4个灯不变,后面4个灯全关,就可以使用与运算
	int number1 = 56;				//0011 1000
	int number2 = 240;				//1111 0000
	int result = number1 & number2;	//0011 0000
}
/*
	与或运算:
		11->0 10->1 01->1 00->0
	规律:
		遇到1该数变为相反,遇到0该数不变
*/
void test3(){
	//0011 1000 如果要把所有的灯反转,关掉的开起来,开起来的关掉,就可以使用异或运算
	int number1 = 56;				//0011 1000
	int number2 = 255;				//1111 1111
	int result = number1 & number2;	//1100 0111
}
/*
	取反:
		1变成0,0变成1
		负数取反是它的补码取反
*/
void test4(){
	//0011 1000
	int number1 = 56;
	int result = 0;
	int number2 = -8;
	//原码:1000 0000 0000 0000 0000 0000 0000 1000
	//反码:1111 1111 1111 1111 1111 1111 1111 0111
	//补码:1111 1111 1111 1111 1111 1111 1111 1000
	printf("%u\n",number2);
	result = ~number2;
	//取反:0000 0000 0000 0000 0000 0000 0000 0111
	printf("%d\n",result);
}
/*
	左移:
		左移相当于乘以2,右边顺势补0即可
*/
void test5(){
	int number = 10;			//0000 1010
	int result = number << 2;	//0010 1000
	printf("%d\n",result);
}
/*
	右移:
		右移相当于除以2,右边补上符号位0或者1
		如果是负数右移,则%d输出时结果为该数的绝对值右移加上负号,%u输出时是该结果的补码
		如果是正数右移,则直接是除以2的移动的次数方
*/
void test6(){
	int number = -20;
	int result = number >> 2;
	printf("%d\n",result);
}
int main(){
	test4();
	//test5();
	//test6();
	return 0;
}
